Repository: 84000/data-translation-memory
Catalog: toh267-v1.tmx
Source language: bo
Languages: en

source: ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་མཐའ་ཡས་མུ་མེད་པ་དག་ན་དུས་གསུམ་དུ་གཤེགས་ཤིང་བཞུགས་པའི་སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་འཁོར་དང་བཅས་པ་རབ་འབྱམ་མ་ལུས་པའི་དཀོན་མཆོག་ཐམས་ཅད་ལ་གུས་པས་ཕྱག་འཚལ་ལོ།
en: Devoted prostrations to every one of the myriad Three Jewels, and to the buddhas and bodhisattvas and their retinues, who appear and dwell in the infinite, endless worlds of existence of the ten directions and three times.

source: ཕྱོགས་བཅུའི་སངས་རྒྱས་ཐམས་ཅད་ལ་ཕྱག་འཚལ་ལོ།
en: Prostrations to all the buddhas of the ten directions;

source: ཤར་ཕྱོགས་ཀྱི་སངས་རྒྱས་རིན་ཆེན་འབྱུང་གནས་དེ་བཞིན་གཤེགས་པ་ལ་ཕྱག་འཚལ་ལོ། །
en: Prostrations to the tathāgata Ratnākara, buddha of the east;

source: ལྷོ་ཕྱོགས་ཀྱི་སངས་རྒྱས་མྱ་ངན་མེད་པའི་དཔལ་དེ་བཞིན་གཤེགས་པ་ལ་ཕྱག་འཚལ་ལོ།
en: Prostrations to the tathāgata Aśokaśrī, buddha of the south;

source: ནུབ་ཕྱོགས་ཀྱི་སངས་རྒྱས་རིན་ཆེན་འོད་འཕྲོ་དེ་བཞིན་གཤེགས་པ་ལ་ཕྱག་འཚལ་ལོ། །
en: Prostrations to the tathāgata Ratnārcis, buddha of the west;

source: བྱང་ཕྱོགས་ཀྱི་སངས་རྒྱས་རྒྱལ་བའི་དབང་པོ་དེ་བཞིན་གཤེགས་པ་ལ་ཕྱག་འཚལ་ལོ། །
en: Prostrations to the tathāgata Jinendra, buddha of the north;

source: བྱང་ཤར་མཚམས་ཀྱི་སངས་རྒྱས་ཏིང་ངེ་འཛིན་གྱི་གླང་པོ་དམ་པའི་དཔལ་དེ་བཞིན་གཤེགས་པ་ལ་ཕྱག་འཚལ་ལོ།
en: Prostrations to the tathāgata Samādhi­hastyuttara­śrī, buddha of the northeast;

source: ཤར་ལྷོ་མཚམས་ཀྱི་སངས་རྒྱས་པད་མོ་དམ་པའི་དཔལ་དེ་བཞིན་གཤེགས་པ་ལ་ཕྱག་འཚལ་ལོ།
en: Prostrations to the tathāgata Padmottaraśrī, buddha of the southeast;

source: ལྷོ་ནུབ་མཚམས་ཀྱི་སངས་རྒྱས་ཉི་མའི་དཀྱིལ་འཁོར་སྣང་བ་དམ་པའི་དཔལ་དེ་བཞིན་གཤེགས་པ་ལ་ཕྱག་འཚལ་ལོ། །
en: Prostrations to the tathāgata Sūrya­maṇḍala­pratibhāsottama­śrī, buddha of the southwest;

source: ནུབ་བྱང་མཚམས་ཀྱི་སངས་རྒྱས་གདུགས་དམ་པའི་དཔལ་དེ་བཞིན་གཤེགས་པ་ལ་ཕྱག་འཚལ་ལོ།
en: Prostrations to the tathāgata Chattrottama­śrī, buddha of the northwest;

source: འོག་གི་ཕྱོགས་ཀྱི་སངས་རྒྱས་པད་མོའི་དཔལ་དེ་བཞིན་གཤེགས་པ་ལ་ཕྱག་འཚལ་ལོ།
en: Prostrations to the tathāgata Padmaśrī, buddha of the nadir;

source: བླ་མ་ཕྱོགས་ཀྱི་སངས་རྒྱས་དགའ་བའི་དཔལ་དེ་བཞིན་གཤེགས་པ་ལ་ཕྱག་འཚལ་ལོ། །
en: Prostrations to the tathāgata Ānandaśrī, buddha of the zenith.

source: ཡང་ཤར་ཕྱོགས་ཀྱི་སངས་རྒྱས་མི་འཁྲུགས་པ་དེ་བཞིན་གཤེགས་པ་ལ་ཕྱག་འཚལ་ལོ།
en: Again, prostrations to the tathāgata, buddha of the east, Akṣobhya;

source: ལྷོ་ཕྱོགས་ཀྱི་སངས་རྒྱས་རིན་ཆེན་འབྱུང་ལྡན་དེ་བཞིན་གཤེགས་པ་ལ་ཕྱག་འཚལ་ལོ།
en: Prostrations to the tathāgata, buddha of the south, Ratnasaṃbhava;

source: ནུབ་ཕྱོགས་ཀྱི་སངས་རྒྱས་སྣང་བ་མཐའ་ཡས་དེ་བཞིན་གཤེགས་པ་ལ་ཕྱག་འཚལ་ལོ།
en: Prostrations to the tathāgata, buddha of the west, Amitābha;

source: བྱང་ཕྱོགས་ཀྱི་སངས་རྒྱས་དོན་ཡོད་གྲུབ་པ་དེ་བཞིན་གཤེགས་པ་ལ་ཕྱག་འཚལ་ལོ།
en: Prostrations to the tathāgata, buddha of the north, Amoghasiddhi;

source: སངས་རྒྱས་དཔའ་བརྟན་པའི་སྡེ་དགའ་བའི་རྒྱལ་པོ་དེ་བཞིན་གཤེགས་པ་ལ་ཕྱག་འཚལ་ལོ། །
en: Prostrations to the tathāgata, Buddha Joyous King Vīrasena;

source: སངས་རྒྱས་ཚེ་མཐའ་ཡས་དེ་བཞིན་གཤེགས་པ་ལ་ཕྱག་འཚལ་ལོ། །
en: Prostrations to the tathāgata, Buddha Amitāyus;

source: སངས་རྒྱས་མི་འཁྲུགས་པ་དེ་བཞིན་གཤེགས་པ་ལ་ཕྱག་འཚལ་ལོ། །
en: Prostrations to the tathāgata, Buddha Akṣobhya;

source: སངས་རྒྱས་སྨན་གྱི་བླ་བཻ་དཱུརྱའི་འོད་ཀྱི་རྒྱལ་པོ་དེ་བཞིན་གཤེགས་པ་ལ་ཕྱག་འཚལ་ལོ། །
en: Prostrations to the tathāgata, Buddha Bhaiṣajya­guru­vaiḍūrya­prabha­rāja;

source: སངས་རྒྱས་སཱ་ལའི་མེ་ཏོག་ཀུན་ཏུ་རྒྱས་པའི་དབང་པོའི་རྒྱལ་པོ་དེ་བཞིན་གཤེགས་པ་ལ་ཕྱག་འཚལ་ལོ། །
en: Prostrations to the tathāgata, Buddha Śāla­saṃkusumita­rājendra;

source: སངས་རྒྱས་ཤཱཀྱ་ཐུབ་པ་དེ་བཞིན་གཤེགས་པ་ལ་ཕྱག་འཚལ་ལོ། །
en: Prostrations to the tathāgata, Buddha Śākyamuni;

source: སངས་རྒྱས་རིན་པོ་ཆེའི་དཔལ་གྱི་རྒྱལ་པོ་དེ་བཞིན་གཤེགས་པ་ལ་ཕྱག་འཚལ་ལོ། །
en: Prostrations to the tathāgata, Buddha Ratnaśrīrāja;

source: སངས་རྒྱས་ཀུན་ཏུ་བཟང་པོ་དེ་བཞིན་གཤེགས་པ་ལ་ཕྱག་འཚལ་ལོ། །
en: Prostrations to the tathāgata, Buddha Samantabhadra;

source: སངས་རྒྱས་རྣམ་པར་སྣང་མཛད་དེ་བཞིན་གཤེགས་པ་ལ་ཕྱག་འཚལ་ལོ། །
en: Prostrations to the tathāgata, Buddha Vairocana;

source: སངས་རྒྱས་ཨུད་པ་ལ་རྒྱས་པ་བསུང་གི་རྒྱལ་པོ་དེ་བཞིན་གཤེགས་པ་ལ་ཕྱག་འཚལ་ལོ། །
en: Prostrations to the tathāgata, Buddha King Whose Fragrance Is That of a Blossoming Utpala;

source: ངུར་སྨྲིག་གི་རྒྱལ་མཚན་གྱི་འཇིག་རྟེན་ན། སངས་རྒྱས་རྡོ་རྗེ་སྙིང་པོས་རབ་ཏུ་འདུལ་བ་དེ་བཞིན་གཤེགས་པ་ལ་ཕྱག་འཚལ་ལོ། །
en: Prostrations to the tathāgata in the World of the Saffron-Colored Victory Banners, Buddha Well Tamed by the Vajra Essence;

source: ཕྱིར་མི་ལྡོག་པའི་འཁོར་ལོ་བསྒྲགས་པའི་འཇིག་རྟེན་ན། སངས་རྒྱས་རབ་ཏུ་གདོན་མི་ཟ་བ་པད་མོ་རྒྱས་པའི་སྐུ་དེ་བཞིན་གཤེགས་པ་ལ་ཕྱག་འཚལ་ལོ། །
en: Prostrations to the tathāgata in the World in Which the Wheel of No Regress Has Been Proclaimed, Buddha Whose Body Is the Blossoming Lotus of Complete Absence of Doubt;

source: རྡུལ་མེད་པའི་འཇིག་རྟེན་ན། སངས་རྒྱས་སེང་གེ་དེ་བཞིན་གཤེགས་པ་ལ་ཕྱག་འཚལ་ལོ། །
en: Prostrations to the tathāgata in the World without Dust, Buddha Siṃha;

source: རབ་ཏུ་སྣང་བའི་འཇིག་རྟེན་ན་སངས་རྒྱས་རིན་པོ་ཆེའི་གཙུག་ཕུད་དེ་བཞིན་གཤེགས་པ་ལ་ཕྱག་འཚལ་ལོ། །
en: Prostrations to the tathāgata in the World of Supreme Illumination, Buddha Ratnaśikhin;

source: འོད་བཟང་པོའི་འཇིག་རྟེན་ན། སངས་རྒྱས་རྣམ་པར་སྣང་མཛད་དེ་བཞིན་གཤེགས་པ་ལ་ཕྱག་འཚལ་ལོ། །
en: Prostrations to the tathāgata in the World of Noble Light, Buddha Vairocana;

source: འདའ་བར་དཀའ་བའི་འཇིག་རྟེན་ན། སངས་རྒྱས་ཆོས་ཀྱི་འོད་ཟེར་རབ་ཏུ་རྒྱས་པའི་སྐུ་དེ་བཞིན་གཤེགས་པ་ལ་ཕྱག་འཚལ་ལོ། །
en: Prostrations to the tathāgata in the World That Is Difficult to Transcend, Buddha Whose Body Is the Widely Spreading Light of the Dharma;

source: རབ་ཏུ་བཟང་པོའི་འཇིག་རྟེན་ན། སངས་རྒྱས་ཐམས་ཅད་མཁྱེན་པའི་བློ་གྲོས་འོད་ཟེར་གྱི་རྒྱལ་པོ་དེ་བཞིན་གཤེགས་པ་ལ་ཕྱག་འཚལ་ལོ། །
en: Prostrations to the tathāgata in the World That Is Supremely Noble, Buddha King Who Is the Light of Intelligence That Understands All;

source: མེ་ལོང་གི་དཀྱིལ་འཁོར་བསྒྲགས་པའི་འཇིག་རྟེན་ན། སངས་རྒྱས་ཟླ་བའི་ཐུགས་དེ་བཞིན་གཤེགས་པ་ལ་ཕྱག་འཚལ་ལོ། །
en: Prostrations to the tathāgata in the World Where the Mirror-Disk Has Been Proclaimed, Buddha Whose Mind Is like the Moon;

source: པད་མོ་དཔལ་གྱི་འཇིག་རྟེན་ན། སངས་རྒྱས་དཔལ་བཟང་པོ་དེ་བཞིན་གཤེགས་པའི་བར་ཐམས་ཅད་ལ་ཕྱག་འཚལ་ལོ། །
en: Prostrations to all the tathāgatas in the World of the Glory of the Lotus, the splendid noble buddhas.

source: སངས་རྒྱས་ཟླ་འོད་དེ་བཞིན་གཤེགས་པ་ལ་ཕྱག་འཚལ་ལོ། །
en: Prostrations to the tathāgata, Buddha Candraprabha;

source: སངས་རྒྱས་མཛེས་ཆེན་དེ་བཞིན་གཤེགས་པ་ལ་ཕྱག་འཚལ་ལོ། །
en: Prostrations to the tathāgata, Buddha Greatly Handsome;

source: སངས་རྒྱས་འཇིག་རྟེན་གྱི་དཀྱིལ་འཁོར་དབང་པོའི་རྒྱལ་པོ་དེ་བཞིན་གཤེགས་པ་ལ་ཕྱག་འཚལ་ལོ། །
en: Prostrations to the tathāgata, Buddha King Who is Lord of the World’s Orb;

source: སངས་རྒྱས་དགའ་བའི་སྤྱན་དེ་བཞིན་གཤེགས་པ་ལ་ཕྱག་འཚལ་ལོ། །
en: Prostrations to the tathāgata, Buddha Joyful Eyes;

source: སངས་རྒྱས་རྒྱ་མཚོའི་དཔལ་དེ་བཞིན་གཤེགས་པ་ལ་ཕྱག་འཚལ་ལོ། །
en: Prostrations to the tathāgata, Buddha Sāgaraśrī;

source: སངས་རྒྱས་གསེར་གྱི་གཟུ་བ་དེ་བཞིན་གཤེགས་པ་ལ་ཕྱག་འཚལ་ལོ། །
en: Prostrations to the tathāgata, Buddha Golden Pillar;

source: སངས་རྒྱས་མཐའ་ཡས་པའི་ཡོན་ཏན་གྱི་འོད་ཟེར་དེ་བཞིན་གཤེགས་པ་ལ་ཕྱག་འཚལ་ལོ། །
en: Prostrations to the tathāgata, Buddha Light of Infinite Good Qualities;

source: སངས་རྒྱས་སྨོན་ལམ་ཐམས་ཅད་ལས་འབྱུང་བའི་རིན་པོ་ཆེའི་གཟི་བརྗིད་ཤིན་ཏུ་འཕགས་པའི་རྒྱལ་པོ་དེ་བཞིན་གཤེགས་པ་ལ་ཕྱག་འཚལ་ལོ། །
en: Prostrations to the tathāgata, Buddha King Who Is Extremely Exalted by the Precious Majesty Arising from All Aspirations;

source: སངས་རྒྱས་གྲགས་པའི་སྒྲ་དབྱངས་ཀྱི་རྒྱལ་པོ་དེ་བཞིན་གཤེགས་པ་ལ་ཕྱག་འཚལ་ལོ། །
en: Prostrations to the tathāgata, Buddha King of Renowned Melodious Sounds;

source: སངས་རྒྱས་ཡེ་ཤེས་རྡོ་རྗེའི་རྒྱ་མཚོའི་དབང་པོ་དེ་བཞིན་གཤེགས་པ་ལ་ཕྱག་འཚལ་ལོ།
en: Prostrations to the tathāgata, Buddha Lord of the Ocean That Is the Wisdom Vajra;

source: སངས་རྒྱས་རྣམ་པར་གཟིགས་དེ་བཞིན་གཤེགས་པ་ལ་ཕྱག་འཚལ་ལོ། །
en: Prostrations to the tathāgata, Buddha Vipaśyin;

source: སངས་རྒྱས་གཙུག་ཏོར་ཅན་དེ་བཞིན་གཤེགས་པ་ལ་ཕྱག་འཚལ་ལོ། །
en: Prostrations to the tathāgata, Buddha Śikhin;

source: སངས་རྒྱས་མ་ལུས་པའི་དབང་པོ་དེ་བཞིན་གཤེགས་པ་ལ་ཕྱག་འཚལ་ལོ།
en: Prostrations to the tathāgata, Buddha Viśvabhū;

source: སངས་རྒྱས་ལོག་པར་དད་སེལ་དེ་བཞིན་གཤེགས་པ་ལ་ཕྱག་འཚལ་ལོ། །
en: Prostrations to the tathāgata, Buddha Krakucchanda;

source: སངས་རྒྱས་གསེར་ཐུབ་དེ་བཞིན་གཤེགས་པ་ལ་ཕྱག་འཚལ་ལོ། །
en: Prostrations to the tathāgata, Buddha Kanakamuni;

source: སངས་རྒྱས་འོད་སྲུང་དེ་བཞིན་གཤེགས་པ་ལ་ཕྱག་འཚལ་ལོ། །
en: Prostrations to the tathāgata, Buddha Kāśyapa;

source: འདས་པའི་སངས་རྒྱས་ཐམས་ཅད་ལ་ཕྱག་འཚལ་ལོ། །
en: Prostrations to all past buddhas;

source: ད་ལྟར་བཞུགས་པའི་སངས་རྒྱས་ཐམས་ཅད་ལ་ཕྱག་འཚལ་ལོ། །
en: Prostrations to all buddhas dwelling in the present;

source: མ་བྱོན་པའི་སངས་རྒྱས་ཐམས་ཅད་ལ་ཕྱག་འཚལ་ལོ། །
en: Prostrations to all future buddhas;

source: བྱང་ཆུབ་སེམས་དཔའི་དཔལ་རྣམ་པར་སྣང་མཛད་ཆེན་པོ་ཐམས་ཅད་ལ་ཕྱག་འཚལ་ལོ། །
en: Prostrations to the glory of the bodhisattvas, all the great illuminators;

source: སངས་རྒྱས་ཆོས་ཀྱི་སྐུ་མུ་མེད་པ་ལ་ཕྱག་འཚལ་ལོ། །
en: Prostrations to the Buddha’s infinite dharmakāya;

source: འཇིག་རྟེན་གྱི་ཁམས་མཐའ་ཡས་པའི་སྐུ་གཟུགས་ཐམས་ཅད་ལ་ཕྱག་འཚལ་ལོ། །
en: Prostrations to all rupakāyas in infinite worlds;

source: རིང་བསྲེལ་ཐམས་ཅད་ལ་ཕྱག་འཚལ་ལོ། །
en: Prostrations to all relics;

source: མཆོད་རྟེན་ཐམས་ཅད་ལ་ཕྱག་འཚལ་ལོ། །
en: Prostrations to all stūpas.

source: དམ་པའི་ཆོས་མདོའི་སྡེ་ལ་ཕྱག་འཚལ་ལོ། །
en: Prostrations to the category of sūtras, the holy Dharma;

source: དབྱངས་ཀྱིས་བསྙད་པའི་སྡེ་ལ་ཕྱག་འཚལ་ལོ། །
en: Prostrations to the category of melodic verses;

source: ལུང་དུ་བསྟན་པའི་སྡེ་ལ་ཕྱག་འཚལ་ལོ། །
en: Prostrations to the category of prophetic teachings;

source: ཚིགས་སུ་བཅད་པའི་སྡེ་ལ་ཕྱག་འཚལ་ལོ། །
en: Prostrations to the category of metered verses;

source: ཆེད་དུ་བརྗོད་པའི་སྡེ་ལ་ཕྱག་འཚལ་ལོ། །
en: Prostrations to the category of special accounts;

source: གླེང་གཞིའི་སྡེ་ལ་ཕྱག་འཚལ་ལོ། །
en: Prostrations to the category of themes;

source: རྟོགས་པ་བརྗོད་པའི་སྡེ་ལ་ཕྱག་འཚལ་ལོ། །
en: Prostrations to the category of illustrative accounts;

source: འདས་པ་བརྗོད་པའི་སྡེ་ལ་ཕྱག་འཚལ་ལོ། །
en: Prostrations to the category of parables;

source: སྐྱེས་པ་རབས་ཀྱི་སྡེ་ལ་ཕྱག་འཚལ་ལོ། །
en: Prostrations to the category of past life accounts;

source: ཤིན་ཏུ་རྒྱས་པའི་སྡེ་ལ་ཕྱག་འཚལ་ལོ། །
en: Prostrations to the category of extensive scriptures;

source: རྨད་དུ་བྱུང་བའི་སྡེ་ལ་ཕྱག་འཚལ་ལོ། །
en: Prostrations to the category of marvelous teachings;

source: ཆོས་རྟོགས་པ་བསྟན་པའི་སྡེ་ལ་ཕྱག་འཚལ་ལོ། །
en: Prostrations to the category of finalized instructions;

source: བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་ཐེག་པ་ཆེན་པོའི་མཛོད་ཐམས་ཅད་ལ་ཕྱག་འཚལ་ལོ། །
en: Prostrations to the Bodhisattvapiṭaka, the entire treasure of the Mahāyāna;

source: ཕྱོགས་བཅུ་དུས་གསུམ་གྱི་གསུང་རབ་ཐམས་ཅད་དང་། འདུལ་བ་ཐབས་ཀྱི་སྒོ་མོ་མ་ལུས་པ་ཐམས་ཅད་ལ་ཕྱག་འཚལ་ལོ། །
en: Prostrations to all scriptures of the ten directions and three times, and to every possible method of taming without exception;

source: ཆོས་ཀྱི་དབྱིངས་ཡང་དག་པའི་མཐའ་བརྗོད་དུ་མེད་པ་ལ་ཕྱག་འཚལ་ལོ། །
en: Prostrations to the dharmadhātu, indescribable ultimate perfection;

source: དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་ཡུམ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སོགས་ཏེ། དམ་པའི་ཆོས་ཀྱི་ཡི་གེ་ཐམས་ཅད་ལ་ཕྱག་འཚལ་ལོ། །
en: Prostrations to every syllable of the holy Dharma, such as the mother of all tathāgatas, the Prajñāpāramitā.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྣང་མཛད་ལ་ཕྱག་འཚལ་ལོ།
en: Prostrations to the bodhisattvas, mahāsattvas, illuminators;

source: ཤར་ཕྱོགས་ཀྱི་བྱང་ཆུབ་སེམས་དཔའ་འོད་ཟེར་ཀུན་ནས་འབྱུང་བ་ལ་ཕྱག་འཚལ་ལོ། །
en: Prostrations to the bodhisattva of the east, Samantaprabha;

source: ལྷོ་ཕྱོགས་ཀྱི་བྱང་ཆུབ་སེམས་དཔའ་མྱ་ངན་མེད་པས་བྱིན་ལ་ཕྱག་འཚལ་ལོ། །
en: Prostrations to the bodhisattva of the south, Aśokadatta;

source: ནུབ་ཕྱོགས་ཀྱི་བྱང་ཆུབ་སེམས་དཔའ་སྤྱོད་པའི་བློ་གྲོས་ལ་ཕྱག་འཚལ་ལོ། །
en: Prostrations to the bodhisattva of the west, Intelligence in Conduct;

source: བྱང་ཕྱོགས་ཀྱི་བྱང་ཆུབ་སེམས་དཔའ་རྒྱལ་བས་བྱིན་ལ་ཕྱག་འཚལ་ལོ། །
en: Prostrations to the bodhisattva of the north, Jayadatta;

source: བྱང་ཤར་མཚམས་ཀྱི་བྱང་ཆུབ་སེམས་དཔའ་རྣམ་པར་རྒྱལ་བས་རྣམ་པར་གནོན་པ་ལ་ཕྱག་འཚལ་ལོ། །
en: Prostrations to the bodhisattva of the northeast, Vijaya­vikrāmin;

source: ཤར་ལྷོ་མཚམས་ཀྱི་བྱང་ཆུབ་སེམས་དཔའ་ལག་ན་པད་མོ་ལ་ཕྱག་འཚལ་ལོ། །
en: Prostrations to the bodhisattva of the southeast, Padmapāṇi;

source: ལྷོ་ནུབ་མཚམས་ཀྱི་བྱང་ཆུབ་སེམས་དཔའ་ཉི་མ་རབ་ཏུ་སྣང་བ་ལ་ཕྱག་འཚལ་ལོ། །
en: Prostrations to the bodhisattva of the southwest, Sūrya­prabha;

source: ནུབ་བྱང་མཚམས་ཀྱི་བྱང་ཆུབ་སེམས་དཔའ་རིན་ཆེན་མཆོག་ལ་ཕྱག་འཚལ་ལོ། །
en: Prostrations to the bodhisattva of the northwest, Exalted Jewel;

source: འོག་གི་ཕྱོགས་ཀྱི་བྱང་ཆུབ་སེམས་དཔའ་པད་མོ་དམ་པ་ལ་ཕྱག་འཚལ་ལོ། །
en: Prostrations to the bodhisattva of the nadir, Padmottara;

source: བླ་མ་ཕྱོགས་ཀྱི་བྱང་ཆུབ་སེམས་དཔའ་དགའ་བས་བྱིན་ལ་ཕྱག་འཚལ་ལོ།
en: Prostrations to the bodhisattva of the zenith, Given by Joy;

source: བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཏུ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་ཕྱུག་ལ་ཕྱག་འཚལ་ལོ། །
en: Prostrations to the bodhisattva Lord Avalokiteśvara;

source: བྱང་ཆུབ་སེམས་དཔའ་བྱམས་པ་ལ་ཕྱག་འཚལ་ལོ། །
en: Prostrations to the bodhisattva Maitreya;

source: བྱང་ཆུབ་སེམས་དཔའ་ནམ་མཁའི་སྙིང་པོ་ལ་ཕྱག་འཚལ་ལོ། །
en: Prostrations to the bodhisattva Ākāśagarbha;

source: བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཏུ་བཟང་པོ་ལ་ཕྱག་འཚལ་ལོ། །
en: Prostrations to the bodhisattva Samantabhadra;

source: བྱང་ཆུབ་སེམས་དཔའ་ཕྱག་ན་རྡོ་རྗེ་ལ་ཕྱག་འཚལ་ལོ། །
en: Prostrations to the bodhisattva Vajrapāṇi;

source: བྱང་ཆུབ་སེམས་དཔའ་འཇམ་དཔལ་ལ་ཕྱག་འཚལ་ལོ། །
en: Prostrations to the bodhisattva Mañjuśrī;

source: བྱང་ཆུབ་སེམས་དཔའ་སྒྲིབ་པ་ཐམས་ཅད་རྣམ་པར་སེལ་བ་ལ་ཕྱག་འཚལ་ལོ།
en: Prostrations to the bodhisattva Sarva­nīvaraṇa­viṣkambhin;

source: བྱང་ཆུབ་སེམས་དཔའ་སའི་སྙིང་པོ་ལ་ཕྱག་འཚལ་ལོ། །
en: Prostrations to the bodhisattva Kṣitigarbha;

source: བྱང་ཆུབ་སེམས་དཔའ་དྲི་མ་མེད་པར་གྲགས་པ་ལ་ཕྱག་འཚལ་ལོ། །
en: Prostrations to the bodhisattva Vimalakīrti;

source: བྱང་ཆུབ་སེམས་དཔའ་མཐུ་ཆེན་ཐོབ་པ་ལ་ཕྱག་འཚལ་ལོ། །
en: Prostrations to the bodhisattva Mahā­sthāma­prāpta;

source: ཕྱོགས་བཅུ་དུས་གསུམ་གྱི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཐམས་ཅད་ལ་ཕྱག་འཚལ་ལོ། །
en: Prostrations to the all the bodhisattvas, mahāsattvas of the ten directions and three times.

source: ཤེས་རབ་ཆེན་པོའི་མཆོག་འཕགས་པ་ཤཱ་རིའི་བུ་ལ་ཕྱག་འཚལ་ལོ། །
en: Prostrations to noble Śāriputra, foremost in great wisdom;

source: རྫུ་འཕྲུལ་ཆེན་པོའི་མཆོག་འཕགས་པ་མཽད་གལ་གྱི་བུ་ལ་ཕྱག་འཚལ་ལོ། །
en: Prostrations to noble Maudgalyāyana, foremost in great miracles;

source: མང་དུ་ཐོས་པའི་མཆོག་འཕགས་པ་ཀུན་དགའ་བོ་ལ་ཕྱག་འཚལ་ལོ། །
en: Prostrations to noble Ānanda, foremost in having heard much;

source: སྦྱངས་པའི་ཡོན་ཏན་གྱི་མཆོག་འཕགས་པ་འོད་སྲུང་ལ་ཕྱག་འཚལ་ལོ། །
en: Prostrations to noble Kāśyapa‌, foremost in the good qualities of discipline;

source: བསླབ་པ་ལ་གུས་པའི་མཆོག་འཕགས་པ་ནོར་སྦྱིན་འཛིན་ལ་ཕྱག་འཚལ་ལོ། །
en: Prostrations to noble Kauṇḍinya, foremost in devotion to the precepts;

source: འདུལ་བ་འཛིན་པའི་མཆོག་འཕགས་པ་ཉེ་བར་འཁོར་ལ་ཕྱག་འཚལ་ལོ།
en: Prostrations to noble Upāli, foremost in holding the Vinaya;

source: རྫུ་འཕྲུལ་གྱི་སྤྱན་མངའ་བའི་མཆོག་འཕགས་པ་མ་འགགས་པ་ལ་ཕྱག་འཚལ་ལོ། །
en: Prostrations to noble Aniruddha, foremost in possessing the miracle eye;

source: འདྲི་ཞིང་ལན་ལྡོན་པའི་མཆོག་འཕགས་པ་རབ་འབྱོར་ལ་ཕྱག་འཚལ་ལོ། །
en: Prostrations to noble Subhūti, foremost in questioning and answering;

source: འཕགས་པ་དགྲ་བཅོམ་པའི་དགེ་འདུན་ཐམས་ཅད་ལ་ཕྱག་འཚལ་ལོ། །
en: Prostrations to the entire assembly of noble arhats;

source: འཕགས་པ་རང་སངས་རྒྱས་ཐམས་ཅད་ལ་ཕྱག་འཚལ་ལོ།
en: Prostrations to all pratyekabuddhas;

source: ཕྱོགས་བཅུའི་དགེ་འདུན་བཞུགས་སོ་འཚལ་ཐམས་ཅད་ལ་ཕྱག་འཚལ་ལོ། །
en: Prostrations to all the saṅgha dwelling in the ten directions.

source: དཀོན་མཆོག་གསུམ་ལ་དད་པས་ཕྱག་འཚལ་ནས། །
en: Through these prostrations with devotion to the Three Jewels,

source: སྡིག་པ་ཀུན་བྱང་དགེ་ཚོགས་རྣམ་པར་འཕེལ། །
en: May all negativities be purified, may the accumulation of merit fully flourish,

source: བཅོམ་ལྡན་སོ་སོའི་བཀའ་ལས་ཅི་འབྱུང་བ། །ཡོན་ཏན་ཁྱད་པར་ཅན་དེ་གྲུབ་པར་ཤོག །
en: And may the special good qualities Arising from the sermons of each bhagavān be accomplished.

source: ཕྱོགས་བཅུའི་དཀོན་མཆོག་གསུམ་ལ་ཕྱག་འཚལ་ལོ། །
en: Prostrations to all the Three Jewels in the ten directions.

source: བསྟོད་ཅིང་བསྔགས་སོ། །བལྟ་ཞིང་བརྟག་གོ། །
en: I praise and glorify them, behold and discern them.

source: བྱང་ཆུབ་སེམས་དཔའི་བསོད་ནམས་རབ་འབྱམ་ལས་བྱུང་བ་མི་མཉམ་པ་དང་མཉམ་པའི་མཆོད་པ་སྣ་ཚོགས་མཆོག །གཙོ་བོ། དམ་པ། ཁྱད་པར་ཅན། བཟང་པོ། གྱ་ནོམ་པ། བླ་ན་མེད་པ། མི་མཉམ་པ་དང་མཉམ་པས་ཕྱོགས་བཅུའི་སྣོད་ཀྱི་འཇིག་རྟེན་ཐམས་ཅད་བྱུར་བུར་བཀང་སྟེ། ཆོས་ཀྱི་མཆོད་པ་དང་བཅས་པས་མ་ལུས་མི་ལུས་ལུས་པ་མེད་པའི་དཀོན་མཆོག་གསུམ་ལ་ཕྱི་མའི་མུའི་མཐར་རྟག་ཏུ་རྒྱུན་མི་འཆད་པར་མཆོད་ཅིང་འདོན་ཏོ། །
en: I constantly offer and venerate, unceasingly until the end of time, all of the Three Jewels that have not been, are not now, nor ever will be relinquished. I make Dharma offerings, as well as a variety of offerings comparable to the incomparable, that arise from the infinite merit of the bodhisattvas, and are exalted, foremost, holy, special, noble, supreme and unsurpassable, comparable to the incomparable, and that completely fill the entire world of the ten directions.

source: དབུལ་ཞིང་གསོལ་ལོ། །བཀུར་སྟིར་བགྱིའོ། །བླ་མར་བགྱིའོ། །རི་མོར་བགྱིའོ། །མཉེས་པར་བགྱིའོ། །
en: Having offered these, please accept them. I shall venerate, honor, respect, and please you.

source: བདག་ཅག་གི་སྐྱེ་བ་འདི་དང་སྐྱེ་བ་ཐོག་མ་དང་ཐ་མ་མ་མཆིས་པ་ནས་སྲིད་པ་གསུམ་གྱི་འཁོར་བ་ན་འཁོར་ཞིང་འདོད་ཆགས་དང་། ཞེ་སྡང་དང་། གཏི་མུག་གསུམ་གྱི་དབང་གིས་ལུས་དང་། ངག་དང་། ཡིད་ཀྱི་སྒོ་ནས་མི་དགེ་བ་བཅུ་དང་། མཚམས་མེད་པ་ལྔ་ལ་སོགས་ཏེ། གསུང་རབ་ཀུན་ལས་འགལ་བའི་སྡིག་པ་མི་དགེ་བའི་ལས་བདག་གིས་ཅི་བགྱིས་པ་དང་། གཞན་ལ་བཅོལ་བ་དང་། གཞན་བགྱིད་པ་ལ་རྗེས་སུ་ཡི་རང་བ་དེ་དག་རྡུལ་ཙམ་བག་ཙམ་ཡང་མ་ལུས་པར་མཐོལ་ཞིང་བཤགས་སོ།
en: Not holding back even the most trifling, I avow and confess the sins and nonvirtuous actions that contradict all holy scripture and that I myself have committed in this life or while wandering in the three worlds through beginningless, endless births, or that I caused others to perform, or even that I rejoiced in when performed by others. They are the ten nonvirtues of body, speech, and mind that were committed under the influence of desire, anger, and ignorance; the five heinous crimes; and so forth.

source: སྦྱངས་ཤིང་བསལ་ཏོ། །གཞིག་ཅིང་གདོན་ཏོ།
en: I purify and dispel them, examine them and cast them out.

source: མི་འཆབ་བོ། །མི་སྦེད་དོ། །མི་བསྙེན་མི་བགྱིད་དོ། །
en: I shall not hide, shall not conceal, and shall not fail to acknowledge them.

source: དེ་ནས་དེའི་ཚེ་སྡིག་པ་ཐམས་ཅད་ནི་བྱང་། བསོད་ནམས་ཐམས་ཅད་ནི་རྫོགས་ཏེ། །
en: Then, at that time, all negativities will be purified, and all merit will be completely accomplished.

source: དུས་འདི་ནས་ནམ་བྱང་ཆུབ་ཀྱི་སྙིང་པོ་ལ་མཆིས་ཀྱི་བར་དུ། དགོངས་པའི་དབང་གིས་ཆེད་དུ་སྤྲུལ་པ་མ་གཏོགས་པར་ནམ་ནམ་ཞར་ཞར་ཚེ་ཚེ་རབས་རབས་སུ་ངན་སོང་གསུམ་ལ་སོགས་ཏེ། བགེགས་རིགས་ཐམས་ཅད་དུ་མི་སྐྱེ་ཞིང་མི་ལྟུང་བར་ཤོག་ཤིག །
en: From this time until the essence of enlightenment is reached, in every future life, may I never fall into inferior hindering births, such as birth in the three lower realms, excepting only emanations for the benefit of others.

source: ལོག་པ་མི་དགེ་བའི་ལས་ལ་མི་ཕྱོགས་མི་བགྱིད་པར་ཤོག་ཤིག
en: May I never lean toward nor perform wrong, nonvirtuous actions.

source: ལས་དང་ཉོན་མོངས་པའི་རྒྱུ་ལ་མི་ཕྱོགས་མི་བསོགས་པར་ཤོག་ཤིག །
en: May I never lean toward nor accumulate the causes of karma and defilements.

source: སྨད་པའི་ལུས་དང་སྡུག་བསྔལ་གྱི་འབྲས་བུ་ཀུན་ལས་ཐར་ནས་ཕྱིན་ཅད་མི་མྱོང་བར་ཤོག་ཤིག །
en: After being completely freed from results, such as suffering and a contemptible body, may I never again experience them.

source: དུས་འདི་ནས་ནམ་བྱང་ཆུབ་ཀྱི་སྙིང་པོ་ལ་མཆིས་ཀྱི་བར་དུ་སྒོ་གསུམ་ནས་དགེ་བ་ཆུ་བོའི་རྒྱུན་བཞིན་དུ་རྒྱུན་མི་འཆད་པར་ཤོག་ཤིག །
en: From this time until the essence of enlightenment is reached, may the virtues of my body, speech, and mind continue as unceasingly as a stream.

source: ཚེ་རབས་གར་སྐྱེས་ཀྱང་བདེ་སྐྱིད་ཕུན་སུམ་ཚོགས་པ་དང་ལྡན་ཏེ།
en: In whatever life I might be born, may I possess magnificent happiness and joy,

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་དོན་བྱ་བ་ལ་མཐུ་དང་དབང་ཡོད་པར་ཤོག་ཤིག །
en: and attain the ability and power to work for the benefit of all sentient beings.

source: གང་དེ་བཞིན་གཤེགས་པ་འབའ་ཞིག་གི་ཐུགས་སུ་ཆུད་པའི་ཆོས་བླ་ན་མེད་པའི་བྱང་ཆུབ་ཏུ་གདོན་མི་ཟ་བར་འཚང་རྒྱ་བའི་དོན་དེ་ཁོ་ན་ཉིད་གང་ཡིན་པ་དེ་
en: That Dharma which is understood only by the tathāgatas, that suchness which without doubt causes unsurpassable enlightenment

source: བདག་གིས་ཀྱང་མ་ནོར་བར་ཁོང་དུ་ཆུད་ཅིང་བསྒོམས་ལ། གཞན་དག་ལ་ཡང་མ་ནོར་བར་སྟོན་ཅིང་འདྲེན་པར་ཤོག་ཤིག །
en: —may I fully understand it without mistake, meditate upon it, teach it to others without mistake, and guide them.

source: དུས་འདི་ནས་ནམ་བྱང་ཆུབ་ཀྱི་སྙིང་པོ་ལ་མཆིས་ཀྱི་བར་དུ་དཀོན་མཆོག་གསུམ་ལ་སྐྱབས་སུ་མཆི་སྟེ། བདག་ཉིད་ལུས་དབུལ་གྱིས་ཐུགས་རྗེ་ཆེན་པོ་དང་ལྡན་པ་རྣམས་ཀྱིས་སོ་སོ་ནས་རྟག་ཏུ་བཞེས་ཤིག
en: From this time until the essence of enlightenment is reached, I take refuge in the Three Jewels. I offer them my body; may each of the greatly compassionate ones forever accept it.

source: ཇི་ལྟར་ན་དུས་གསུམ་གྱི་སངས་རྒྱས་དང་། བྱང་ཆུབ་སེམས་དཔའ་དངོས་པོ་ཐམས་ཅད་དང་བྲལ་བ། ཕུང་པོ་དང་། ཁམས་དང་། སྐྱེ་མཆེད་ཀྱིས་མ་ཟིན་པའི་ཆོས་བདག་མེད་པ་དང་མཉམ་པ། ཐོག་མ་ནས་མ་སྐྱེས་པ། སྟོང་པ་ཉིད་ཀྱི་རང་བཞིན་གྱིས་བྱང་ཆུབ་ཀྱི་སེམས་བསྐྱེད་པ་
en: The buddhas and bodhisattvas of the three times, who are free of all things; who are comparable to selfless dharmas not comprised within the aggregates, domains, or bases of cognition; and who are unborn since beginningless time, generated the thought of enlightenment because of their nature of emptiness.

source: ལྟར་བདག་མིང་འདི་ཞེས་བགྱི་བས་ཀྱང་། དུས་འདི་ནས་ནམ་བྱང་ཆུབ་ཀྱི་སྙིང་པོ་ལ་མཆིས་ཀྱི་བར་དུ་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པར་བགྱིའོ། །
en: So, likewise, I whose name is… do also generate the thought of enlightenment from this time until the essence of enlightenment is reached.

source: བྱང་ཆུབ་ཀྱི་སེམས་ནི་ནམ་གཞར་ཡང་མི་སྟོར་ཞིང་དགེ་བའི་བཤེས་གཉེན་དམ་པ་དེ་དང་ནམ་ཡང་མི་འབྲལ་བར་ཤོག་ཤིག
en: May I never lose or disregard the thought of enlightenment, and never be separated from noble spiritual masters.

source: ཇི་ལྟར་དུས་གསུམ་གྱི་སངས་རྒྱས་དེ་དག་བླ་ན་མེད་པའི་བསོད་ནམས་ཀྱི་རྗེས་སུ་ཡི་རང་བ་ལྟར། བདག་མིང་འདི་ཞེས་བགྱི་བས་ཀྱང་འཇིག་རྟེན་དང་འཇིག་རྟེན་ལས་འདས་པའི་བསོད་ནམས་ཐམས་ཅད་ལ་རྗེས་སུ་ཡི་རང་ངོ་། །
en: Just as the buddhas of the three times rejoiced in unsurpassable merit, I whose name is… also rejoice in all worldly and beyond-worldly merit.

source: ནམ་འཆི་བར་ངེས་པའི་དུས་དེ་ན་སངས་རྒྱས་དང་། བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་ཐམས་ཅད་ཀྱི་ཞལ་མངོན་སུམ་དུ་མཐོང་ནས།
en: When the time of death is certain, may I directly behold the holy faces of all those buddhas and bodhisattvas,

source: ཕྱག་གཡས་པ་གསེར་གྱི་ཁ་དོག་ཅན་བརྐྱང་སྟེ། བདག་གི་སྤྱི་བོར་བཞག་ནས་ལུང་ནོད་པར་གྱུར་ཅིག །
en: and when they extend their golden right hands and place them upon my head, may I receive a prophecy.

source: བདག་གིས་ཀྱང་ཉོན་མོངས་པས་སེམས་མི་འཁྲུལ་པར་ཆོས་བདག་མེད་པ་དང་འཐུན་པའི་འདུན་པ་ཅན་དང་། བྱང་ཆུབ་ཀྱི་སེམས་ཚད་མེད་པ་དང་ལྡན་བཞིན་དུ་འཆི་བའི་དུས་བྱེད་པར་ཤོག་ཤིག །
en: And may I die with my mind undeluded by defilements, with aspirations that accord with the selfless dharmas, and with the limitless thought of enlightenment.

source: མདོར་ན་བག་ཆགས་མ་ལུས་ཀུན་བྱང་ནས། །བསོད་ནམས་ཡེ་ཤེས་ཚོགས་གཉིས་ཡོངས་རྫོགས་ཏེ། །
en: In short:

source: འགྲོ་བ་མ་ལུས་བྱིན་གྱིས་བསྒྲལ་བའི་ཕྱིར། །བདག་ཉིད་མྱུར་དུ་མངོན་པར་སངས་རྒྱས་ཤོག །
en: For the purpose of liberating all beings without exception, May I swiftly reach perfect enlightenment.

source: དཔང་སྐོང་ཕྱག་བརྒྱ་པ་རྫོགས་སོ།། །།
en: This completes “ Calling Witness with a Hundred Prostrations

source: བོད་དུ་དམ་པའི་ཆོས་འབྱུང་བའི་སྔ་ལྟས་སུ་ལྷ་ཐོ་ཐོ་རི་སྙན་ཤལ་གྱི་སྐུ་རིང་ལ་ཕོ་བྲང་ཡུམ་བུ་བླ་མཁར་དུ་ནམ་མཁའ་ལས་བབས་མི་རབས་ལྔ་ན་འདིའི་དོན་ཤེས་པ་འོང་ཞེས་རྨི་ལམ་དུ་ལུང་བསྟན་ཏེ་ཆོས་ཀྱི་དབུ་བརྙེས་སོ།། །
en: As an omen of the arising of the holy Dharma in Tibet, during the reign of King Lha Thothori Nyanshal ( lha tho tho ri snyan shal ), this text descended from the sky into the palace Yumbu Lhakhar ( yum bu bla mkhar ). The king dreamed that after five generations it would be possible to understand the meaning of this text. Thus the holy Dharma began.
